<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1,3,640,640" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="images" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
					<rt_info>
						<attribute name="layout" version="0" layout="[N,C,H,W]" />
					</rt_info>
				</port>
			</output>
		</layer>
		<layer id="1" name="/model.22/Constant_8" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.22/Constant_8" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/model.22/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="2" name="Constant_4747" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="3" name="Constant_4748" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="4" name="Constant_4749" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="Range_4750" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_4751" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="20" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Gather_4752" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_4753" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="24" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Divide_4754" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_36967" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36967" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="11" name="Constant_36968" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="36" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36968" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="12" name="Constant_36969" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36969" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="13" name="Constant_36970" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="36" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36970" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="14" name="images/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="images/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model.0.conv.weight" type="Const" version="opset1">
			<data element_type="i8" shape="16, 3, 3, 3" offset="40" size="432" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.0.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Convert_273948" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.0.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_273846" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 1" offset="472" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.0.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/model.0/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.0.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/model.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.0/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Reshape_140" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="536" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_140" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/model.0/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.0/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.0/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/model.0/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.0/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.0/act/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_36977" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="600" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36977" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="24" name="Constant_36978" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="604" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36978" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="25" name="Constant_36979" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="600" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36979" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="26" name="Constant_36980" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="604" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36980" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="27" name="/model.0/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.0/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model.1.conv.weight" type="Const" version="opset1">
			<data element_type="i8" shape="32, 16, 3, 3" offset="608" size="4608" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.1.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Convert_274102" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.1.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_274000" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1" offset="5216" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.1.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model.1/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.1.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model.1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.1/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_157" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="5344" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_157" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/model.1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.1/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model.1/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.1/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_36987" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5472" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36987" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="37" name="Constant_36988" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5476" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36988" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="38" name="Constant_36989" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5472" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36989" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="39" name="Constant_36990" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="5476" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36990" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="40" name="/model.1/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.1/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="i8" shape="32, 32, 1, 1" offset="5480" size="1024" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.cv1.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_274256" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.cv1.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_274154" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1" offset="6504" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.cv1.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model.2/cv1/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.cv1.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/model.2/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv1/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_174" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="6632" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_174" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/model.2/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv1/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/model.2/cv1/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv1/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_36837" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6760" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36837" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="50" name="Constant_36838" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6764" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36838" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="51" name="Constant_36839" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6760" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36839" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="52" name="Constant_36840" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6764" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36840" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="53" name="/model.2/cv1/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv1/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_181" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="6768" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_181" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="55" name="Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="6776" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_9" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Split_141">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/model.2/Split" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/Split" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.2/Split_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="4" precision="FP32" names="/model.2/Split_output_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model.2.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="i8" shape="16, 16, 3, 3" offset="6792" size="2304" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.m.0.cv1.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Convert_274410" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.m.0.cv1.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_274308" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 1" offset="9096" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.m.0.cv1.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model.2/m.0/cv1/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.m.0.cv1.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/model.2/m.0/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv1/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_194" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="9160" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_194" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model.2/m.0/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv1/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/m.0/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/model.2/m.0/cv1/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv1/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/m.0/cv1/act/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_37002" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9224" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37002" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="66" name="Constant_37003" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9228" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37003" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="67" name="Constant_37004" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9224" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37004" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="68" name="Constant_37005" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9228" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37005" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="69" name="/model.2/m.0/cv1/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv1/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model.2.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="i8" shape="16, 16, 3, 3" offset="9232" size="2304" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.m.0.cv2.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Convert_274564" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.m.0.cv2.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_274462" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 1" offset="11536" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.m.0.cv2.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/model.2/m.0/cv2/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.m.0.cv2.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/model.2/m.0/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv2/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Reshape_211" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="11600" size="64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_211" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model.2/m.0/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv2/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/m.0/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/model.2/m.0/cv2/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv2/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/m.0/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_37012" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9224" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37012" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="79" name="Constant_37013" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9228" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37013" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="80" name="Constant_37014" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9224" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37014" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="81" name="Constant_37015" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="9228" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37015" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="82" name="/model.2/m.0/cv2/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/cv2/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/model.2/m.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/m.0/Add_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_36832" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6760" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36832" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="85" name="Constant_36833" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6764" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36833" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="86" name="Constant_36834" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6760" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36834" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="87" name="Constant_36835" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="6764" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_36835" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="88" name="/model.2/m.0/Add/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/m.0/Add/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/model.2/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/Concat" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/model.2/Concat_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model.2.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="i8" shape="32, 48, 1, 1" offset="11664" size="1536" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.cv2.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Convert_274718" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.cv2.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_274616" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 1" offset="13200" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.cv2.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/model.2/cv2/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.2.cv2.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/model.2/cv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv2/conv/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_230" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="13328" size="128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_230" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/model.2/cv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv2/conv/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/model.2/cv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/model.2/cv2/act/Mul" type="Swish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv2/act/Mul" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/model.2/cv2/act/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_37022" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="13456" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37022" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="99" name="Constant_37023" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="13460" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37023" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="100" name="Constant_37024" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="13456" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37024" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="101" name="Constant_37025" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="13460" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_37025" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="102" name="/model.2/cv2/act/Mul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/model.2/cv2/act/Mul/fq_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="model.3.conv.weight" type="Const" version="opset1">
			<data element_type="i8" shape="64, 32, 3, 3" offset="13464" size="18432" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.3.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Convert_274872" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.3.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="I8">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_274770" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 1" offset="31896" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.3.conv.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/model.3/conv/Conv/WithoutBiases/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="model.3.conv.weight" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
